---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceGridlinesStyle
source: html/b830e204-558b-23bc-2593-90f3a395326f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceGridlinesStyle Property

"Gridlines Style"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceGridlinesStyle { get; }
```